In [3]:
word = 'Layla'
sent = 'Layla is cute'

In [4]:
word[0]

'L'

In [5]:
sent[0]

'L'

In [6]:
sent[0:5]

'Layla'

In [7]:
'the layla is cute because she was cute'[:]

'the layla is cute because she was cute'

In [8]:
'the layla is cute because she was cute'[0:]

'the layla is cute because she was cute'

In [9]:
text = 'the layla is cute bacause she was cute'
text[0:len(text)]

'the layla is cute bacause she was cute'

In [10]:
sent[-7:-3]

'is c'

In [12]:
sent[-3:]

'ute'

In [13]:
word[:3]

'Lay'

In [14]:
word[0:3]

'Lay'

In [15]:
sent[4:]

'a is cute'

In [16]:
sent[:]

'Layla is cute'

In [17]:
sent[::2]

'Lyai ue'

In [18]:
a = 'Name : Layla'
b = 'StudentID'
c = 'Hobby : study'
d = 'Comment : cute'

" ".join([a, b, c, d])

'Name : Layla StudentID Hobby : study Comment : cute'

In [19]:
text = """Guard: What? Ridden en a horse?
Queen Raiden: Yes!
Guard: You're using coconutes!
Queen Raiden: What?
Guard: You're Got ... coconuts[s] and You're banagin'em together
"""
str(text.splitlines()[::2])

'[\'Guard: What? Ridden en a horse?\', "Guard: You\'re using coconutes!", "Guard: You\'re Got ... coconuts[s] and You\'re banagin\'em together"]'

In [21]:
str(text.splitlines()[::2]).replace('Guard', 'Yae Miko')

'[\'Yae Miko: What? Ridden en a horse?\', "Yae Miko: You\'re using coconutes!", "Yae Miko: You\'re Got ... coconuts[s] and You\'re banagin\'em together"]'

In [22]:
'{} is cute!'.format('Layla')

'Layla is cute!'

In [23]:
"""{0}는 매우매우 착하고 귀엽고 사랑스럽습니다.
이 사악한 {1}는 {0}을 괴롭히는 원인 중 하나입니다.""".format('레일라','나히다')

'레일라는 매우매우 착하고 귀엽고 사랑스럽습니다.\n이 사악한 나히다는 레일라을 괴롭히는 원인 중 하나입니다.'

In [24]:
'나히다는 {age} 살 이상이다.'.format(age='500')

'나히다는 500 살 이상이다.'

In [25]:
'나는 {:,} 살까지 살 고 싶다!'.format(99999999999999999999)

'나는 99,999,999,999,999,999,999 살까지 살 고 싶다!'

In [26]:
'저는 기억합니다. {0:.3}을, 저는 기억합니다. {0:.3%}을'.format(7/78901)

'저는 기억합니다. 8.87e-05을, 저는 기억합니다. 0.009%을'

In [28]:
'저는 기억합니다. {0:.3}을, 저는 기억합니다. {0:.3%}을'.format(7/78901)

'저는 기억합니다. 8.87e-05을, 저는 기억합니다. 0.009%을'

In [29]:
'My ID number is {0:06d}'.format(12)

'My ID number is 000012'

In [30]:
'my love number is %d' % 7

'my love number is 7'

In [32]:
'%(name)s 는 귀엽지만, 수면 시간이 %(time).2f으로 너무 짧습니다.' % {'name':'Layla', 'time':1.1631212}

'Layla 는 귀엽지만, 수면 시간이 1.16으로 너무 짧습니다.'

In [33]:
name = '레일라'
month = 12
days = 19
f'{name}! {month}/{days}생일 축하해!!'

'레일라! 12/19생일 축하해!!'

In [34]:
import re

In [35]:
ax = re.match(pattern='\d{10}', string='1234567890')
ax

In [36]:
"match" if bool(ax) else "Unmatch"

'match'

In [37]:
ax.start()

0

In [38]:
ax.end()

10

In [39]:
ax.span()

(0, 10)

In [40]:
ax.group()

'1234567890'

In [41]:
re.match(pattern='\d{3}\s\d{4}\s\d{4}', string='123 4567 8901')

In [42]:
re.match(pattern='\(\d{3}\)\s\d{3}\-\d{4}', string='(123) 456-7890')

In [43]:
re.match(pattern='\+\d\s\(\d{3}\)\s\d{3}\-\d{4}', string='+1 (123) 456-7890')

In [45]:
p = re.compile('\D{9}\:\d{4}')
p.match('localhost:8888')

In [46]:
my_exp = lambda x : x ** 2
my_exp_c = lambda x, n : x ** n

In [47]:
import pandas as pd

In [48]:
df = pd.DataFrame({
    'a' : [10, 20, 30],
    'b' : [20, 30, 40]
})

In [49]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [50]:
df['a'] ** 2

0    100
1    400
2    900
Name: a, dtype: int64

In [51]:
df['a'].apply(my_exp)

0    100
1    400
2    900
Name: a, dtype: int64

In [52]:
df['a'].apply(my_exp_c, n=10)

0        10000000000
1     10240000000000
2    590490000000000
Name: a, dtype: int64

In [53]:
printme = lambda x : print(x)

In [54]:
df.apply(printme)

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64

a    None
b    None
dtype: object

In [55]:
df.apply(printme, axis=1)

a    10
b    20
Name: 0, dtype: int64
a    20
b    30
Name: 1, dtype: int64
a    30
b    40
Name: 2, dtype: int64

0    None
1    None
2    None
dtype: object

In [56]:
def invp(data, nume):
    sum = 0
    for i in data:
        sum += i
    if(nume == 0):
        return sum / df.shape[0]
    else:
        return sum / df.shape[1]

In [57]:
df.apply(invp, nume=0)

a    20.0
b    30.0
dtype: float64

In [58]:
df.apply(invp, nume=1, axis=1)

0    15.0
1    25.0
2    35.0
dtype: float64

In [59]:
import seaborn as sns

In [60]:
df = sns.load_dataset("titanic")
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [61]:
getNAN = lambda x : pd.isnull(x).sum()
df.apply(getNAN)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [62]:
getNAN_C = lambda x : (pd.isnull(x).sum()) / len(x)

In [63]:
df.apply(getNAN_C)

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [64]:
getNAN_2 = lambda x : ((pd.isnull(x).sum()) / len(x)) * 100

In [65]:
df.apply(getNAN_2)

survived        0.000000
pclass          0.000000
sex             0.000000
age            19.865320
sibsp           0.000000
parch           0.000000
fare            0.000000
embarked        0.224467
class           0.000000
who             0.000000
adult_male      0.000000
deck           77.216611
embark_town     0.224467
alive           0.000000
alone           0.000000
dtype: float64

In [67]:
getNON_NAN = lambda x : 1 - ((pd.isnull(x).sum()) / len(x))
df.apply(getNON_NAN)

survived       1.000000
pclass         1.000000
sex            1.000000
age            0.801347
sibsp          1.000000
parch          1.000000
fare           1.000000
embarked       0.997755
class          1.000000
who            1.000000
adult_male     1.000000
deck           0.227834
embark_town    0.997755
alive          1.000000
alone          1.000000
dtype: float64

In [70]:
getNON_NAN2 = lambda x : (1- ((pd.isnull(x).sum()) / len(x))) * 100
df.apply(getNON_NAN2)

survived       100.000000
pclass         100.000000
sex            100.000000
age             80.134680
sibsp          100.000000
parch          100.000000
fare           100.000000
embarked        99.775533
class          100.000000
who            100.000000
adult_male     100.000000
deck            22.783389
embark_town     99.775533
alive          100.000000
alone          100.000000
dtype: float64

In [71]:
getFX = lambda x : pd.isnull(x).sum()
df['missing'] = df.apply(getFX, axis = 1)

In [72]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,missing
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,1
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,1
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,1
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,0
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,2
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,0
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,1

In [74]:
df[df['missing'] >= 2].sample(100)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,missing
347,1,3,female,NaN,1,0,16.1000,S,Third,woman,False,NaN,Southampton,yes,False,2
547,1,2,male,NaN,0,0,13.8625,C,Second,man,True,NaN,Cherbourg,yes,True,2
593,0,3,female,NaN,0,2,7.7500,Q,Third,woman,False,NaN,Queenstown,no,False,2
301,1,3,male,NaN,2,0,23.2500,Q,Third,man,True,NaN,Queenstown,yes,False,2
420,0,3,male,NaN,0,0,7.8958,C,Third,man,True,NaN,Cherbourg,no,True,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
388,0,3,male,NaN,0,0,7.7292,Q,Third,man,True,NaN,Queenstown,no,True,2
507,1,1,male,NaN,0,0,26.5500,S,First,man,True,NaN,Southampton,yes,True,2
223,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True,2
837,0,3,male,NaN,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,2
692,1,3,male,NaN,0,0,56.4958,S,Third,man,True,NaN,Southampton,yes,True,2

In [75]:
df = pd.read_csv('../data/gapminder.tsv', sep='\t')
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [76]:
df.groupby('year')['lifeExp'].mean()

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [77]:
df['year'].unique()

array([1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, 2002,
       2007], dtype=int64)